MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_ramcfg.h
/**
  * @brief  Get the ramcfg write protection for the given page.
  * @rmtoll
  *  WPR1           WPR1           LL_RAMCFG_GetPageWRP_0_31
  * @param  p_ramcfg RAMCFG instance
  * @param  page_msk
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref LL_RAMCFG_WRP_PAGE_0
  *         @arg @ref LL_RAMCFG_WRP_PAGE_1
  *         @arg @ref LL_RAMCFG_WRP_PAGE_2
  *         @arg @ref LL_RAMCFG_WRP_PAGE_3
  *         @arg @ref LL_RAMCFG_WRP_PAGE_4
  *         @arg @ref LL_RAMCFG_WRP_PAGE_5
  *         @arg @ref LL_RAMCFG_WRP_PAGE_6
  *         @arg @ref LL_RAMCFG_WRP_PAGE_7
  *         @arg @ref LL_RAMCFG_WRP_PAGE_8
  *         @arg @ref LL_RAMCFG_WRP_PAGE_9
  *         @arg @ref LL_RAMCFG_WRP_PAGE_10
  *         @arg @ref LL_RAMCFG_WRP_PAGE_11
  *         @arg @ref LL_RAMCFG_WRP_PAGE_12
  *         @arg @ref LL_RAMCFG_WRP_PAGE_13
  *         @arg @ref LL_RAMCFG_WRP_PAGE_14
  *         @arg @ref LL_RAMCFG_WRP_PAGE_15
  *         @arg @ref LL_RAMCFG_WRP_PAGE_16
  *         @arg @ref LL_RAMCFG_WRP_PAGE_17
  *         @arg @ref LL_RAMCFG_WRP_PAGE_18
  *         @arg @ref LL_RAMCFG_WRP_PAGE_19
  *         @arg @ref LL_RAMCFG_WRP_PAGE_20
  *         @arg @ref LL_RAMCFG_WRP_PAGE_21
  *         @arg @ref LL_RAMCFG_WRP_PAGE_22
  *         @arg @ref LL_RAMCFG_WRP_PAGE_23
  *         @arg @ref LL_RAMCFG_WRP_PAGE_24
  *         @arg @ref LL_RAMCFG_WRP_PAGE_25
  *         @arg @ref LL_RAMCFG_WRP_PAGE_26
  *         @arg @ref LL_RAMCFG_WRP_PAGE_27
  *         @arg @ref LL_RAMCFG_WRP_PAGE_28
  *         @arg @ref LL_RAMCFG_WRP_PAGE_29
  *         @arg @ref LL_RAMCFG_WRP_PAGE_30
  *         @arg @ref LL_RAMCFG_WRP_PAGE_31
  * @return The return value can be a 0x00000000U or combination of the following values :
  *         @arg @ref LL_RAMCFG_WRP_PAGE_0
  *         @arg @ref LL_RAMCFG_WRP_PAGE_1
  *         @arg @ref LL_RAMCFG_WRP_PAGE_2
  *         @arg @ref LL_RAMCFG_WRP_PAGE_3
  *         @arg @ref LL_RAMCFG_WRP_PAGE_4
  *         @arg @ref LL_RAMCFG_WRP_PAGE_5
  *         @arg @ref LL_RAMCFG_WRP_PAGE_6
  *         @arg @ref LL_RAMCFG_WRP_PAGE_7
  *         @arg @ref LL_RAMCFG_WRP_PAGE_8
  *         @arg @ref LL_RAMCFG_WRP_PAGE_9
  *         @arg @ref LL_RAMCFG_WRP_PAGE_10
  *         @arg @ref LL_RAMCFG_WRP_PAGE_11
  *         @arg @ref LL_RAMCFG_WRP_PAGE_12
  *         @arg @ref LL_RAMCFG_WRP_PAGE_13
  *         @arg @ref LL_RAMCFG_WRP_PAGE_14
  *         @arg @ref LL_RAMCFG_WRP_PAGE_15
  *         @arg @ref LL_RAMCFG_WRP_PAGE_16
  *         @arg @ref LL_RAMCFG_WRP_PAGE_17
  *         @arg @ref LL_RAMCFG_WRP_PAGE_18
  *         @arg @ref LL_RAMCFG_WRP_PAGE_19
  *         @arg @ref LL_RAMCFG_WRP_PAGE_20
  *         @arg @ref LL_RAMCFG_WRP_PAGE_21
  *         @arg @ref LL_RAMCFG_WRP_PAGE_22
  *         @arg @ref LL_RAMCFG_WRP_PAGE_23
  *         @arg @ref LL_RAMCFG_WRP_PAGE_24
  *         @arg @ref LL_RAMCFG_WRP_PAGE_25
  *         @arg @ref LL_RAMCFG_WRP_PAGE_26
  *         @arg @ref LL_RAMCFG_WRP_PAGE_27
  *         @arg @ref LL_RAMCFG_WRP_PAGE_28
  *         @arg @ref LL_RAMCFG_WRP_PAGE_29
  *         @arg @ref LL_RAMCFG_WRP_PAGE_30
  *         @arg @ref LL_RAMCFG_WRP_PAGE_31
  */
__STATIC_INLINE uint32_t LL_RAMCFG_GetPageWRP_0_31(const RAMCFG_TypeDef *p_ramcfg, uint32_t page_msk)
{
  return ((uint32_t)STM32_READ_BIT(p_ramcfg->WPR1, page_msk));
}

#if defined(LL_RAMCFG_WRP_PAGE_32)
/**
  * @brief  Enable the ramcfg write protection for the given page.
  * @rmtoll
  *  WPR2           WPR2           LL_RAMCFG_EnablePageWRP_32_63
  * @param  p_ramcfg RAMCFG instance
  * @param  page_msk
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref LL_RAMCFG_WRP_PAGE_32
  *         @arg @ref LL_RAMCFG_WRP_PAGE_33
  *         @arg @ref LL_RAMCFG_WRP_PAGE_34
  *         @arg @ref LL_RAMCFG_WRP_PAGE_35
  *         @arg @ref LL_RAMCFG_WRP_PAGE_36
  *         @arg @ref LL_RAMCFG_WRP_PAGE_37
  *         @arg @ref LL_RAMCFG_WRP_PAGE_38
  *         @arg @ref LL_RAMCFG_WRP_PAGE_39
  *         @arg @ref LL_RAMCFG_WRP_PAGE_40
  *         @arg @ref LL_RAMCFG_WRP_PAGE_41
  *         @arg @ref LL_RAMCFG_WRP_PAGE_42
  *         @arg @ref LL_RAMCFG_WRP_PAGE_43
  *         @arg @ref LL_RAMCFG_WRP_PAGE_44
  *         @arg @ref LL_RAMCFG_WRP_PAGE_45
  *         @arg @ref LL_RAMCFG_WRP_PAGE_46
  *         @arg @ref LL_RAMCFG_WRP_PAGE_47
  *         @arg @ref LL_RAMCFG_WRP_PAGE_48
  *         @arg @ref LL_RAMCFG_WRP_PAGE_49
  *         @arg @ref LL_RAMCFG_WRP_PAGE_50
  *         @arg @ref LL_RAMCFG_WRP_PAGE_51
  *         @arg @ref LL_RAMCFG_WRP_PAGE_52
  *         @arg @ref LL_RAMCFG_WRP_PAGE_53
  *         @arg @ref LL_RAMCFG_WRP_PAGE_54
  *         @arg @ref LL_RAMCFG_WRP_PAGE_55
  *         @arg @ref LL_RAMCFG_WRP_PAGE_56
  *         @arg @ref LL_RAMCFG_WRP_PAGE_57
  *         @arg @ref LL_RAMCFG_WRP_PAGE_58
  *         @arg @ref LL_RAMCFG_WRP_PAGE_59
  *         @arg @ref LL_RAMCFG_WRP_PAGE_60
  *         @arg @ref LL_RAMCFG_WRP_PAGE_61
  *         @arg @ref LL_RAMCFG_WRP_PAGE_62
  *         @arg @ref LL_RAMCFG_WRP_PAGE_63
  */
__STATIC_INLINE void LL_RAMCFG_EnablePageWRP_32_63(RAMCFG_TypeDef *p_ramcfg, uint32_t page_msk)
{
  STM32_SET_BIT(p_ramcfg->WPR2, page_msk);
}

/**
  * @brief  Check the ramcfg write protection state for the given page.
  * @rmtoll
  *  WPR2           WPR2           LL_RAMCFG_IsEnabledPageWRP_32_63
  * @param  p_ramcfg RAMCFG instance
  * @param  page
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref LL_RAMCFG_WRP_PAGE_32
  *         @arg @ref LL_RAMCFG_WRP_PAGE_33
  *         @arg @ref LL_RAMCFG_WRP_PAGE_34
  *         @arg @ref LL_RAMCFG_WRP_PAGE_35
  *         @arg @ref LL_RAMCFG_WRP_PAGE_36
  *         @arg @ref LL_RAMCFG_WRP_PAGE_37
  *         @arg @ref LL_RAMCFG_WRP_PAGE_38
  *         @arg @ref LL_RAMCFG_WRP_PAGE_39
  *         @arg @ref LL_RAMCFG_WRP_PAGE_40
  *         @arg @ref LL_RAMCFG_WRP_PAGE_41
  *         @arg @ref LL_RAMCFG_WRP_PAGE_42
  *         @arg @ref LL_RAMCFG_WRP_PAGE_43
  *         @arg @ref LL_RAMCFG_WRP_PAGE_44
  *         @arg @ref LL_RAMCFG_WRP_PAGE_45
  *         @arg @ref LL_RAMCFG_WRP_PAGE_46
  *         @arg @ref LL_RAMCFG_WRP_PAGE_47
  *         @arg @ref LL_RAMCFG_WRP_PAGE_48
  *         @arg @ref LL_RAMCFG_WRP_PAGE_49
  *         @arg @ref LL_RAMCFG_WRP_PAGE_50
  *         @arg @ref LL_RAMCFG_WRP_PAGE_51
  *         @arg @ref LL_RAMCFG_WRP_PAGE_52
  *         @arg @ref LL_RAMCFG_WRP_PAGE_53
  *         @arg @ref LL_RAMCFG_WRP_PAGE_54
  *         @arg @ref LL_RAMCFG_WRP_PAGE_55
  *         @arg @ref LL_RAMCFG_WRP_PAGE_56
  *         @arg @ref LL_RAMCFG_WRP_PAGE_57
  *         @arg @ref LL_RAMCFG_WRP_PAGE_58
  *         @arg @ref LL_RAMCFG_WRP_PAGE_59
  *         @arg @ref LL_RAMCFG_WRP_PAGE_60
  *         @arg @ref LL_RAMCFG_WRP_PAGE_61
  *         @arg @ref LL_RAMCFG_WRP_PAGE_62
  *         @arg @ref LL_RAMCFG_WRP_PAGE_63
  * @return State of the selected page (1 : write protected, 0 not write protected)
  */
__STATIC_INLINE uint32_t LL_RAMCFG_IsEnabledPageWRP_32_63(const RAMCFG_TypeDef *p_ramcfg, uint32_t page)
{
  return ((((uint32_t)STM32_READ_BIT(p_ramcfg->WPR2, page)) == page) ? 1U : 0U);
}

/**
  * @brief  Get the ramcfg write protection for the given page.
  * @rmtoll
  *  WPR2           WPR2           LL_RAMCFG_GetPageWRP_32_63
  * @param  p_ramcfg RAMCFG instance
  * @param  page_msk
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref LL_RAMCFG_WRP_PAGE_32
  *         @arg @ref LL_RAMCFG_WRP_PAGE_33
  *         @arg @ref LL_RAMCFG_WRP_PAGE_34
  *         @arg @ref LL_RAMCFG_WRP_PAGE_35
  *         @arg @ref LL_RAMCFG_WRP_PAGE_36
  *         @arg @ref LL_RAMCFG_WRP_PAGE_37
  *         @arg @ref LL_RAMCFG_WRP_PAGE_38
  *         @arg @ref LL_RAMCFG_WRP_PAGE_39
  *         @arg @ref LL_RAMCFG_WRP_PAGE_40
  *         @arg @ref LL_RAMCFG_WRP_PAGE_41
  *         @arg @ref LL_RAMCFG_WRP_PAGE_42
  *         @arg @ref LL_RAMCFG_WRP_PAGE_43
  *         @arg @ref LL_RAMCFG_WRP_PAGE_44
  *         @arg @ref LL_RAMCFG_WRP_PAGE_45
  *         @arg @ref LL_RAMCFG_WRP_PAGE_46
  *         @arg @ref LL_RAMCFG_WRP_PAGE_47
  *         @arg @ref LL_RAMCFG_WRP_PAGE_48
  *         @arg @ref LL_RAMCFG_WRP_PAGE_49
  *         @arg @ref LL_RAMCFG_WRP_PAGE_50
  *         @arg @ref LL_RAMCFG_WRP_PAGE_51
  *         @arg @ref LL_RAMCFG_WRP_PAGE_52
  *         @arg @ref LL_RAMCFG_WRP_PAGE_53
  *         @arg @ref LL_RAMCFG_WRP_PAGE_54
  *         @arg @ref LL_RAMCFG_WRP_PAGE_55
  *         @arg @ref LL_RAMCFG_WRP_PAGE_56
  *         @arg @ref LL_RAMCFG_WRP_PAGE_57
  *         @arg @ref LL_RAMCFG_WRP_PAGE_58
  *         @arg @ref LL_RAMCFG_WRP_PAGE_59
  *         @arg @ref LL_RAMCFG_WRP_PAGE_60
  *         @arg @ref LL_RAMCFG_WRP_PAGE_61
  *         @arg @ref LL_RAMCFG_WRP_PAGE_62
  *         @arg @ref LL_RAMCFG_WRP_PAGE_63
  * @return The return value can be a 0x00000000U or combination of the following values :
  *         @arg @ref LL_RAMCFG_WRP_PAGE_32
  *         @arg @ref LL_RAMCFG_WRP_PAGE_33
  *         @arg @ref LL_RAMCFG_WRP_PAGE_34
  *         @arg @ref LL_RAMCFG_WRP_PAGE_35
  *         @arg @ref LL_RAMCFG_WRP_PAGE_36
  *         @arg @ref LL_RAMCFG_WRP_PAGE_37
  *         @arg @ref LL_RAMCFG_WRP_PAGE_38
  *         @arg @ref LL_RAMCFG_WRP_PAGE_39
  *         @arg @ref LL_RAMCFG_WRP_PAGE_40
  *         @arg @ref LL_RAMCFG_WRP_PAGE_41
  *         @arg @ref LL_RAMCFG_WRP_PAGE_42
  *         @arg @ref LL_RAMCFG_WRP_PAGE_43
  *         @arg @ref LL_RAMCFG_WRP_PAGE_44
  *         @arg @ref LL_RAMCFG_WRP_PAGE_45
  *         @arg @ref LL_RAMCFG_WRP_PAGE_46
  *         @arg @ref LL_RAMCFG_WRP_PAGE_47
  *         @arg @ref LL_RAMCFG_WRP_PAGE_48
  *         @arg @ref LL_RAMCFG_WRP_PAGE_49
  *         @arg @ref LL_RAMCFG_WRP_PAGE_50
  *         @arg @ref LL_RAMCFG_WRP_PAGE_51
  *         @arg @ref LL_RAMCFG_WRP_PAGE_52
  *         @arg @ref LL_RAMCFG_WRP_PAGE_53
  *         @arg @ref LL_RAMCFG_WRP_PAGE_54
  *         @arg @ref LL_RAMCFG_WRP_PAGE_55
  *         @arg @ref LL_RAMCFG_WRP_PAGE_56
  *         @arg @ref LL_RAMCFG_WRP_PAGE_57
  *         @arg @ref LL_RAMCFG_WRP_PAGE_58
  *         @arg @ref LL_RAMCFG_WRP_PAGE_59
  *         @arg @ref LL_RAMCFG_WRP_PAGE_60
  *         @arg @ref LL_RAMCFG_WRP_PAGE_61
  *         @arg @ref LL_RAMCFG_WRP_PAGE_62
  *         @arg @ref LL_RAMCFG_WRP_PAGE_63
  */
__STATIC_INLINE uint32_t LL_RAMCFG_GetPageWRP_32_63(const RAMCFG_TypeDef *p_ramcfg, uint32_t page_msk)
{
  return ((uint32_t)STM32_READ_BIT(p_ramcfg->WPR2, page_msk));
}
#endif /* LL_RAMCFG_WRP_PAGE_32 */

#if defined (LL_RAMCFG_WRP_PAGE_64)
/**
  * @brief  Enable the ramcfg write protection for the given page.
  * @rmtoll
  *  WPR3           WPR3           LL_RAMCFG_EnablePageWRP_64_95
  * @param  p_ramcfg RAMCFG instance
  * @param  page_msk
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref LL_RAMCFG_WRP_PAGE_64
  *         @arg @ref LL_RAMCFG_WRP_PAGE_65
  *         @arg @ref LL_RAMCFG_WRP_PAGE_66
  *         @arg @ref LL_RAMCFG_WRP_PAGE_67
  *         @arg @ref LL_RAMCFG_WRP_PAGE_68
  *         @arg @ref LL_RAMCFG_WRP_PAGE_69
  *         @arg @ref LL_RAMCFG_WRP_PAGE_70
  *         @arg @ref LL_RAMCFG_WRP_PAGE_71
  *         @arg @ref LL_RAMCFG_WRP_PAGE_72
  *         @arg @ref LL_RAMCFG_WRP_PAGE_73
  *         @arg @ref LL_RAMCFG_WRP_PAGE_74
  *         @arg @ref LL_RAMCFG_WRP_PAGE_75
  *         @arg @ref LL_RAMCFG_WRP_PAGE_76
  *         @arg @ref LL_RAMCFG_WRP_PAGE_77
  *         @arg @ref LL_RAMCFG_WRP_PAGE_78
  *         @arg @ref LL_RAMCFG_WRP_PAGE_79
  *         @arg @ref LL_RAMCFG_WRP_PAGE_80
  *         @arg @ref LL_RAMCFG_WRP_PAGE_81
  *         @arg @ref LL_RAMCFG_WRP_PAGE_82
  *         @arg @ref LL_RAMCFG_WRP_PAGE_83
  *         @arg @ref LL_RAMCFG_WRP_PAGE_84
  *         @arg @ref LL_RAMCFG_WRP_PAGE_85
  *         @arg @ref LL_RAMCFG_WRP_PAGE_86
  *         @arg @ref LL_RAMCFG_WRP_PAGE_87
  *         @arg @ref LL_RAMCFG_WRP_PAGE_88
  *         @arg @ref LL_RAMCFG_WRP_PAGE_89
  *         @arg @ref LL_RAMCFG_WRP_PAGE_90
  *         @arg @ref LL_RAMCFG_WRP_PAGE_91
  *         @arg @ref LL_RAMCFG_WRP_PAGE_92
  *         @arg @ref LL_RAMCFG_WRP_PAGE_93
  *         @arg @ref LL_RAMCFG_WRP_PAGE_94
  *         @arg @ref LL_RAMCFG_WRP_PAGE_95
  */
__STATIC_INLINE void LL_RAMCFG_EnablePageWRP_64_95(RAMCFG_TypeDef *p_ramcfg, uint32_t page_msk)
{
  STM32_SET_BIT(p_ramcfg->WPR3, page_msk);
}

/**
  * @brief  Check the ramcfg write protection state for the given page.
  * @rmtoll
  *  WPR3           WPR3           LL_RAMCFG_IsEnabledPageWRP_64_95
  * @param  p_ramcfg RAMCFG instance
  * @param  page_
  *         This parameter can be one of the following values:
  *         @arg @ref LL_RAMCFG_WRP_PAGE_64
  *         @arg @ref LL_RAMCFG_WRP_PAGE_65
  *         @arg @ref LL_RAMCFG_WRP_PAGE_66
  *         @arg @ref LL_RAMCFG_WRP_PAGE_67
  *         @arg @ref LL_RAMCFG_WRP_PAGE_68
  *         @arg @ref LL_RAMCFG_WRP_PAGE_69
  *         @arg @ref LL_RAMCFG_WRP_PAGE_70
  *         @arg @ref LL_RAMCFG_WRP_PAGE_71
  *         @arg @ref LL_RAMCFG_WRP_PAGE_72
  *         @arg @ref LL_RAMCFG_WRP_PAGE_73
  *         @arg @ref LL_RAMCFG_WRP_PAGE_74
  *         @arg @ref LL_RAMCFG_WRP_PAGE_75
  *         @arg @ref LL_RAMCFG_WRP_PAGE_76
  *         @arg @ref LL_RAMCFG_WRP_PAGE_77
  *         @arg @ref LL_RAMCFG_WRP_PAGE_78
  *         @arg @ref LL_RAMCFG_WRP_PAGE_79
  *         @arg @ref LL_RAMCFG_WRP_PAGE_80
  *         @arg @ref LL_RAMCFG_WRP_PAGE_81
  *         @arg @ref LL_RAMCFG_WRP_PAGE_82
  *         @arg @ref LL_RAMCFG_WRP_PAGE_83
  *         @arg @ref LL_RAMCFG_WRP_PAGE_84
  *         @arg @ref LL_RAMCFG_WRP_PAGE_85
  *         @arg @ref LL_RAMCFG_WRP_PAGE_86
  *         @arg @ref LL_RAMCFG_WRP_PAGE_87
  *         @arg @ref LL_RAMCFG_WRP_PAGE_88
  *         @arg @ref LL_RAMCFG_WRP_PAGE_89
  *         @arg @ref LL_RAMCFG_WRP_PAGE_90
  *         @arg @ref LL_RAMCFG_WRP_PAGE_91
  *         @arg @ref LL_RAMCFG_WRP_PAGE_92
  *         @arg @ref LL_RAMCFG_WRP_PAGE_93
  *         @arg @ref LL_RAMCFG_WRP_PAGE_94
  *         @arg @ref LL_RAMCFG_WRP_PAGE_95
  * @return State of the selected page (1: write protected, 0: not write protected)
  */
__STATIC_INLINE uint32_t LL_RAMCFG_IsEnabledPageWRP_64_95(const RAMCFG_TypeDef *p_ramcfg, uint32_t page)
{
  return ((((uint32_t)STM32_READ_BIT(p_ramcfg->WPR3, page)) == page) ? 1U : 0U);
}

/**
  * @brief  Get the ramcfg write protection for the given page.
  * @rmtoll
  *  WPR3           WPR3           LL_RAMCFG_GetPageWRP_64_95
  * @param  p_ramcfg RAMCFG instance
  * @param  page_msk
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref LL_RAMCFG_WRP_PAGE_64
  *         @arg @ref LL_RAMCFG_WRP_PAGE_65
  *         @arg @ref LL_RAMCFG_WRP_PAGE_66
  *         @arg @ref LL_RAMCFG_WRP_PAGE_67
  *         @arg @ref LL_RAMCFG_WRP_PAGE_68
  *         @arg @ref LL_RAMCFG_WRP_PAGE_69
  *         @arg @ref LL_RAMCFG_WRP_PAGE_70
  *         @arg @ref LL_RAMCFG_WRP_PAGE_71
  *         @arg @ref LL_RAMCFG_WRP_PAGE_72
  *         @arg @ref LL_RAMCFG_WRP_PAGE_73
  *         @arg @ref LL_RAMCFG_WRP_PAGE_74
  *         @arg @ref LL_RAMCFG_WRP_PAGE_75
  *         @arg @ref LL_RAMCFG_WRP_PAGE_76
  *         @arg @ref LL_RAMCFG_WRP_PAGE_77
  *         @arg @ref LL_RAMCFG_WRP_PAGE_78
  *         @arg @ref LL_RAMCFG_WRP_PAGE_79
  *         @arg @ref LL_RAMCFG_WRP_PAGE_80
  *         @arg @ref LL_RAMCFG_WRP_PAGE_81
  *         @arg @ref LL_RAMCFG_WRP_PAGE_82
  *         @arg @ref LL_RAMCFG_WRP_PAGE_83
  *         @arg @ref LL_RAMCFG_WRP_PAGE_84
  *         @arg @ref LL_RAMCFG_WRP_PAGE_85
  *         @arg @ref LL_RAMCFG_WRP_PAGE_86
  *         @arg @ref LL_RAMCFG_WRP_PAGE_87
  *         @arg @ref LL_RAMCFG_WRP_PAGE_88
  *         @arg @ref LL_RAMCFG_WRP_PAGE_89
  *         @arg @ref LL_RAMCFG_WRP_PAGE_90
  *         @arg @ref LL_RAMCFG_WRP_PAGE_91
  *         @arg @ref LL_RAMCFG_WRP_PAGE_92
  *         @arg @ref LL_RAMCFG_WRP_PAGE_93
  *         @arg @ref LL_RAMCFG_WRP_PAGE_94
  *         @arg @ref LL_RAMCFG_WRP_PAGE_95
  * @return The return value can be a 0x00000000U or combination of the following values :
  *         @arg @ref LL_RAMCFG_WRP_PAGE_64
  *         @arg @ref LL_RAMCFG_WRP_PAGE_65
  *         @arg @ref LL_RAMCFG_WRP_PAGE_66
  *         @arg @ref LL_RAMCFG_WRP_PAGE_67
  *         @arg @ref LL_RAMCFG_WRP_PAGE_68
  *         @arg @ref LL_RAMCFG_WRP_PAGE_69
  *         @arg @ref LL_RAMCFG_WRP_PAGE_70
  *         @arg @ref LL_RAMCFG_WRP_PAGE_71
  *         @arg @ref LL_RAMCFG_WRP_PAGE_72
  *         @arg @ref LL_RAMCFG_WRP_PAGE_73
  *         @arg @ref LL_RAMCFG_WRP_PAGE_74
  *         @arg @ref LL_RAMCFG_WRP_PAGE_75
  *         @arg @ref LL_RAMCFG_WRP_PAGE_76
  *         @arg @ref LL_RAMCFG_WRP_PAGE_77
  *         @arg @ref LL_RAMCFG_WRP_PAGE_78
  *         @arg @ref LL_RAMCFG_WRP_PAGE_79
  *         @arg @ref LL_RAMCFG_WRP_PAGE_80
  *         @arg @ref LL_RAMCFG_WRP_PAGE_81
  *         @arg @ref LL_RAMCFG_WRP_PAGE_82
  *         @arg @ref LL_RAMCFG_WRP_PAGE_83
  *         @arg @ref LL_RAMCFG_WRP_PAGE_84
  *         @arg @ref LL_RAMCFG_WRP_PAGE_85
  *         @arg @ref LL_RAMCFG_WRP_PAGE_86
  *         @arg @ref LL_RAMCFG_WRP_PAGE_87
  *         @arg @ref LL_RAMCFG_WRP_PAGE_88
  *         @arg @ref LL_RAMCFG_WRP_PAGE_89
  *         @arg @ref LL_RAMCFG_WRP_PAGE_90
  *         @arg @ref LL_RAMCFG_WRP_PAGE_91
  *         @arg @ref LL_RAMCFG_WRP_PAGE_92
  *         @arg @ref LL_RAMCFG_WRP_PAGE_93
  *         @arg @ref LL_RAMCFG_WRP_PAGE_94
  *         @arg @ref LL_RAMCFG_WRP_PAGE_95
  */
__STATIC_INLINE uint32_t LL_RAMCFG_GetPageWRP_64_95(const RAMCFG_TypeDef *p_ramcfg, uint32_t page_msk)
{
  return ((uint32_t)STM32_READ_BIT(p_ramcfg->WPR3, page_msk));
}
#endif /* LL_RAMCFG_WRP_PAGE_64 */

#if defined (LL_RAMCFG_WRP_PAGE_96)
/**
  * @brief  Enable the ramcfg write protection for the given page.
  * @rmtoll
  *  WPR4           WPR4           LL_RAMCFG_EnablePageWRP_96_127
  * @param  p_ramcfg RAMCFG instance
  * @param  page_msk
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref LL_RAMCFG_WRP_PAGE_96
  *         @arg @ref LL_RAMCFG_WRP_PAGE_97
  *         @arg @ref LL_RAMCFG_WRP_PAGE_98
  *         @arg @ref LL_RAMCFG_WRP_PAGE_99
  *         @arg @ref LL_RAMCFG_WRP_PAGE_100
  *         @arg @ref LL_RAMCFG_WRP_PAGE_101
  *         @arg @ref LL_RAMCFG_WRP_PAGE_102
  *         @arg @ref LL_RAMCFG_WRP_PAGE_103
  *         @arg @ref LL_RAMCFG_WRP_PAGE_104
  *         @arg @ref LL_RAMCFG_WRP_PAGE_105
  *         @arg @ref LL_RAMCFG_WRP_PAGE_106
  *         @arg @ref LL_RAMCFG_WRP_PAGE_107
  *         @arg @ref LL_RAMCFG_WRP_PAGE_108
  *         @arg @ref LL_RAMCFG_WRP_PAGE_109
  *         @arg @ref LL_RAMCFG_WRP_PAGE_110
  *         @arg @ref LL_RAMCFG_WRP_PAGE_111
  *         @arg @ref LL_RAMCFG_WRP_PAGE_112
  *         @arg @ref LL_RAMCFG_WRP_PAGE_113
  *         @arg @ref LL_RAMCFG_WRP_PAGE_114
  *         @arg @ref LL_RAMCFG_WRP_PAGE_115
  *         @arg @ref LL_RAMCFG_WRP_PAGE_116
  *         @arg @ref LL_RAMCFG_WRP_PAGE_117
  *         @arg @ref LL_RAMCFG_WRP_PAGE_118
  *         @arg @ref LL_RAMCFG_WRP_PAGE_119
  *         @arg @ref LL_RAMCFG_WRP_PAGE_120
  *         @arg @ref LL_RAMCFG_WRP_PAGE_121
  *         @arg @ref LL_RAMCFG_WRP_PAGE_122
  *         @arg @ref LL_RAMCFG_WRP_PAGE_123
  *         @arg @ref LL_RAMCFG_WRP_PAGE_124
  *         @arg @ref LL_RAMCFG_WRP_PAGE_125
  *         @arg @ref LL_RAMCFG_WRP_PAGE_126
  *         @arg @ref LL_RAMCFG_WRP_PAGE_127
  */
__STATIC_INLINE void LL_RAMCFG_EnablePageWRP_96_127(RAMCFG_TypeDef *p_ramcfg, uint32_t page_msk)
{
  STM32_SET_BIT(p_ramcfg->WPR4, page_msk);
}

/**
  * @brief  Check the ramcfg write protection state for the given page.
  * @rmtoll
  *  WPR4           WPR4           LL_RAMCFG_IsEnabledPageWRP_96_127
  * @param  p_ramcfg RAMCFG instance
  * @param  page
  *         This parameter can be one of the following values:
  *         @arg @ref LL_RAMCFG_WRP_PAGE_96
  *         @arg @ref LL_RAMCFG_WRP_PAGE_97
  *         @arg @ref LL_RAMCFG_WRP_PAGE_98
  *         @arg @ref LL_RAMCFG_WRP_PAGE_99
  *         @arg @ref LL_RAMCFG_WRP_PAGE_100
  *         @arg @ref LL_RAMCFG_WRP_PAGE_101
  *         @arg @ref LL_RAMCFG_WRP_PAGE_102
  *         @arg @ref LL_RAMCFG_WRP_PAGE_103
  *         @arg @ref LL_RAMCFG_WRP_PAGE_104
  *         @arg @ref LL_RAMCFG_WRP_PAGE_105
  *         @arg @ref LL_RAMCFG_WRP_PAGE_106
  *         @arg @ref LL_RAMCFG_WRP_PAGE_107
  *         @arg @ref LL_RAMCFG_WRP_PAGE_108
  *         @arg @ref LL_RAMCFG_WRP_PAGE_109
  *         @arg @ref LL_RAMCFG_WRP_PAGE_110
  *         @arg @ref LL_RAMCFG_WRP_PAGE_111
  *         @arg @ref LL_RAMCFG_WRP_PAGE_112
  *         @arg @ref LL_RAMCFG_WRP_PAGE_113
  *         @arg @ref LL_RAMCFG_WRP_PAGE_114
  *         @arg @ref LL_RAMCFG_WRP_PAGE_115
  *         @arg @ref LL_RAMCFG_WRP_PAGE_116
  *         @arg @ref LL_RAMCFG_WRP_PAGE_117
  *         @arg @ref LL_RAMCFG_WRP_PAGE_118
  *         @arg @ref LL_RAMCFG_WRP_PAGE_119
  *         @arg @ref LL_RAMCFG_WRP_PAGE_120
  *         @arg @ref LL_RAMCFG_WRP_PAGE_121
  *         @arg @ref LL_RAMCFG_WRP_PAGE_122
  *         @arg @ref LL_RAMCFG_WRP_PAGE_123
  *         @arg @ref LL_RAMCFG_WRP_PAGE_124
  *         @arg @ref LL_RAMCFG_WRP_PAGE_125
  *         @arg @ref LL_RAMCFG_WRP_PAGE_126
  *         @arg @ref LL_RAMCFG_WRP_PAGE_127
  * @return State of the selected page (1 : write protected, 0 not write protected)
  */
__STATIC_INLINE uint32_t LL_RAMCFG_IsEnabledPageWRP_96_127(const RAMCFG_TypeDef *p_ramcfg, uint32_t page)
{
  return ((((uint32_t)STM32_READ_BIT(p_ramcfg->WPR4, page)) == page) ? 1U : 0U);
}

