MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_ramcfg.h
/**
  * @brief  Get the ramcfg write protection for the given page.
  * @rmtoll
  *  WPR4           WPR4           LL_RAMCFG_GetPageWRP_96_127
  * @param  p_ramcfg RAMCFG instance
  * @param  page_msk
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref LL_RAMCFG_WRP_PAGE_96
  *         @arg @ref LL_RAMCFG_WRP_PAGE_97
  *         @arg @ref LL_RAMCFG_WRP_PAGE_98
  *         @arg @ref LL_RAMCFG_WRP_PAGE_99
  *         @arg @ref LL_RAMCFG_WRP_PAGE_100
  *         @arg @ref LL_RAMCFG_WRP_PAGE_101
  *         @arg @ref LL_RAMCFG_WRP_PAGE_102
  *         @arg @ref LL_RAMCFG_WRP_PAGE_103
  *         @arg @ref LL_RAMCFG_WRP_PAGE_104
  *         @arg @ref LL_RAMCFG_WRP_PAGE_105
  *         @arg @ref LL_RAMCFG_WRP_PAGE_106
  *         @arg @ref LL_RAMCFG_WRP_PAGE_107
  *         @arg @ref LL_RAMCFG_WRP_PAGE_108
  *         @arg @ref LL_RAMCFG_WRP_PAGE_109
  *         @arg @ref LL_RAMCFG_WRP_PAGE_110
  *         @arg @ref LL_RAMCFG_WRP_PAGE_111
  *         @arg @ref LL_RAMCFG_WRP_PAGE_112
  *         @arg @ref LL_RAMCFG_WRP_PAGE_113
  *         @arg @ref LL_RAMCFG_WRP_PAGE_114
  *         @arg @ref LL_RAMCFG_WRP_PAGE_115
  *         @arg @ref LL_RAMCFG_WRP_PAGE_116
  *         @arg @ref LL_RAMCFG_WRP_PAGE_117
  *         @arg @ref LL_RAMCFG_WRP_PAGE_118
  *         @arg @ref LL_RAMCFG_WRP_PAGE_119
  *         @arg @ref LL_RAMCFG_WRP_PAGE_120
  *         @arg @ref LL_RAMCFG_WRP_PAGE_121
  *         @arg @ref LL_RAMCFG_WRP_PAGE_122
  *         @arg @ref LL_RAMCFG_WRP_PAGE_123
  *         @arg @ref LL_RAMCFG_WRP_PAGE_124
  *         @arg @ref LL_RAMCFG_WRP_PAGE_125
  *         @arg @ref LL_RAMCFG_WRP_PAGE_126
  *         @arg @ref LL_RAMCFG_WRP_PAGE_127
  * @return The return value can be a 0x00000000U or combination of the following values :
  *         @arg @ref LL_RAMCFG_WRP_PAGE_96
  *         @arg @ref LL_RAMCFG_WRP_PAGE_97
  *         @arg @ref LL_RAMCFG_WRP_PAGE_98
  *         @arg @ref LL_RAMCFG_WRP_PAGE_99
  *         @arg @ref LL_RAMCFG_WRP_PAGE_100
  *         @arg @ref LL_RAMCFG_WRP_PAGE_101
  *         @arg @ref LL_RAMCFG_WRP_PAGE_102
  *         @arg @ref LL_RAMCFG_WRP_PAGE_103
  *         @arg @ref LL_RAMCFG_WRP_PAGE_104
  *         @arg @ref LL_RAMCFG_WRP_PAGE_105
  *         @arg @ref LL_RAMCFG_WRP_PAGE_106
  *         @arg @ref LL_RAMCFG_WRP_PAGE_107
  *         @arg @ref LL_RAMCFG_WRP_PAGE_108
  *         @arg @ref LL_RAMCFG_WRP_PAGE_109
  *         @arg @ref LL_RAMCFG_WRP_PAGE_110
  *         @arg @ref LL_RAMCFG_WRP_PAGE_111
  *         @arg @ref LL_RAMCFG_WRP_PAGE_112
  *         @arg @ref LL_RAMCFG_WRP_PAGE_113
  *         @arg @ref LL_RAMCFG_WRP_PAGE_114
  *         @arg @ref LL_RAMCFG_WRP_PAGE_115
  *         @arg @ref LL_RAMCFG_WRP_PAGE_116
  *         @arg @ref LL_RAMCFG_WRP_PAGE_117
  *         @arg @ref LL_RAMCFG_WRP_PAGE_118
  *         @arg @ref LL_RAMCFG_WRP_PAGE_119
  *         @arg @ref LL_RAMCFG_WRP_PAGE_120
  *         @arg @ref LL_RAMCFG_WRP_PAGE_121
  *         @arg @ref LL_RAMCFG_WRP_PAGE_122
  *         @arg @ref LL_RAMCFG_WRP_PAGE_123
  *         @arg @ref LL_RAMCFG_WRP_PAGE_124
  *         @arg @ref LL_RAMCFG_WRP_PAGE_125
  *         @arg @ref LL_RAMCFG_WRP_PAGE_126
  *         @arg @ref LL_RAMCFG_WRP_PAGE_127
  */
__STATIC_INLINE uint32_t LL_RAMCFG_GetPageWRP_96_127(const RAMCFG_TypeDef *p_ramcfg, uint32_t page_msk)
{
  return ((uint32_t)STM32_READ_BIT(p_ramcfg->WPR4, page_msk));
}
#endif /* LL_RAMCFG_WRP_PAGE_96 */

/**
  * @brief  Set the ramcfg unlock key for the ECC mechanism.
  * @rmtoll
  *  ECCKEYR           ECCKEY           LL_RAMCFG_SetECCKey
  * @param  p_ramcfg RAMCFG instance
  * @param  key
  *         This parameter must respect the following order:
  *         @arg @ref LL_RAMCFG_ECC_KEY_1
  *         @arg @ref LL_RAMCFG_ECC_KEY_2
  */
__STATIC_INLINE void LL_RAMCFG_SetECCKey(RAMCFG_TypeDef *p_ramcfg, uint32_t key)
{
  STM32_WRITE_REG(p_ramcfg->ECCKEYR, key);
}

/**
  * @brief  Set the ramcfg unlock key for the Erase operation.
  * @rmtoll
  *  ERKEYR           ERASEKEY           LL_RAMCFG_SetEraseKey
  * @param  p_ramcfg RAMCFG instance
  * @param  key
  *         This parameter must respect the following order:
  *         @arg @ref LL_RAMCFG_ERASE_KEY_1
  *         @arg @ref LL_RAMCFG_ERASE_KEY_2
  */
__STATIC_INLINE void LL_RAMCFG_SetEraseKey(RAMCFG_TypeDef *p_ramcfg, uint32_t key)
{
  STM32_WRITE_REG(p_ramcfg->ERKEYR, key);
}

/** @defgroup RAMCFG_LL_EF_FLAG_Management LL RAMCFG Flag Management
  * @{
  */

/**
  * @brief  Clear the RAMCFG pending flags.
  * @rmtoll
  *  ICR           CSEDC           LL_RAMCFG_ClearFlag \n
  *  ICR           CDED            LL_RAMCFG_ClearFlag
  * @param  p_ramcfg RAMCFG Instance.
  * @param  flags Flag to clear.
  *         This parameter can be one of the following values:
  *            @arg @ref LL_RAMCFG_FLAG_SEDC    : ECC Single Error Detected and Corrected Flag.
  *            @arg @ref LL_RAMCFG_FLAG_DED     : ECC Double Error Detected Flag.
  *            @arg @ref LL_RAMCFG_FLAG_ECC_ALL : ECC Single Error Detected and Corrected Flag
                                                  and ECC Double Error Detected Flag.
  */
__STATIC_INLINE void LL_RAMCFG_ClearFlag(RAMCFG_TypeDef *p_ramcfg, uint32_t flags)
{
  STM32_WRITE_REG(p_ramcfg->ICR, flags);
}

/**
  * @brief  Clear the RAMCFG ECC Single Error Detected and Corrected flag.
  * @rmtoll
  *  ICR           CSEDC           LL_RAMCFG_ClearFlag_SEDC
  * @param  p_ramcfg RAMCFG Instance.
  */
__STATIC_INLINE void LL_RAMCFG_ClearFlag_SEDC(RAMCFG_TypeDef *p_ramcfg)
{
  STM32_WRITE_REG(p_ramcfg->ICR, LL_RAMCFG_FLAG_SEDC);
}

/**
  * @brief  Clear the RAMCFG ECC Double Error Detected flag.
  * @rmtoll
  *  ICR           CDED            LL_RAMCFG_ClearFlag_DED
  * @param  p_ramcfg RAMCFG Instance.
  */
__STATIC_INLINE void LL_RAMCFG_ClearFlag_DED(RAMCFG_TypeDef *p_ramcfg)
{
  STM32_WRITE_REG(p_ramcfg->ICR, LL_RAMCFG_FLAG_DED);
}

/**
  * @brief  Read the state of the RAMCFG flags.
  * @rmtoll
  *  ISR         SRAMBUSY         LL_RAMCFG_ReadFlag \n
  *  ISR           SEDC           LL_RAMCFG_ReadFlag \n
  *  ISR           DED            LL_RAMCFG_ReadFlag
  * @param  p_ramcfg RAMCFG Instance.
  * @param  flags Flags to read.
  *         This parameter can be one or a combination of the following values:
  *           @arg @ref LL_RAMCFG_FLAG_SEDC     : ECC Single Error Detected and Corrected Flag.
  *           @arg @ref LL_RAMCFG_FLAG_DED      : ECC Double Error Detected Flag.
  *           @arg @ref LL_RAMCFG_FLAG_ECC_ALL  : ECC Single Error Detected and Corrected Flag
                                                  and ECC Double Error Detected Flag.
              @arg @ref LL_RAMCFG_FLAG_SRAMBUSY : SRAM busy with erase operation Flag.
  * @retval State of selected flags.
            The return value can be one or a combination of the following values:
              @arg @ref LL_RAMCFG_FLAG_SEDC
              @arg @ref LL_RAMCFG_FLAG_DED
              @arg @ref LL_RAMCFG_FLAG_ECC_ALL
              @arg @ref LL_RAMCFG_FLAG_SRAMBUSY
  */
__STATIC_INLINE uint32_t LL_RAMCFG_ReadFlag(const RAMCFG_TypeDef *p_ramcfg, uint32_t flags)
{
  return STM32_READ_BIT(p_ramcfg->ISR, flags);
}

/**
  * @brief  Get the RAMCFG ECC Single Error Detected and Corrected flag.
  * @rmtoll
  *  ISR           SEDC               LL_RAMCFG_IsActiveFlag_SEDC
  * @param  p_ramcfg RAMCFG Instance.
  * @return State of SE flag (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RAMCFG_IsActiveFlag_SEDC(const RAMCFG_TypeDef *p_ramcfg)
{
  return ((STM32_READ_BIT(p_ramcfg->ISR, LL_RAMCFG_FLAG_SEDC) == (LL_RAMCFG_FLAG_SEDC)) ? 1UL : 0UL);
}

/**
  * @brief  Get the RAMCFG ECC Double Error Detected flag.
  * @rmtoll
  *  ISR           DED                LL_RAMCFG_IsActiveFlag_DED
  * @param  p_ramcfg RAMCFG Instance.
  * @return State of DE flag (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RAMCFG_IsActiveFlag_DED(const RAMCFG_TypeDef *p_ramcfg)
{
  return ((STM32_READ_BIT(p_ramcfg->ISR, LL_RAMCFG_FLAG_DED) == (LL_RAMCFG_FLAG_DED)) ? 1UL : 0UL);
}

/**
  * @brief  Get the RAMCFG SRAM Busy flag.
  * @rmtoll
  *  ISR           SRAMBUSY            LL_RAMCFG_IsActiveFlag_SRAMBUSY
  * @param  p_ramcfg RAMCFG Instance.
  * @return State of SRAM Busy flag (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RAMCFG_IsActiveFlag_SRAMBUSY(const RAMCFG_TypeDef *p_ramcfg)
{
  return ((STM32_READ_BIT(p_ramcfg->ISR, LL_RAMCFG_FLAG_SRAMBUSY) == (LL_RAMCFG_FLAG_SRAMBUSY)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup RAMCFG_LL_EF_IT_Management LL RAMCFG IT Management
  * @{
  */

/**
  * @brief  Enable the specified RAMCFG interrupts.
  * @rmtoll
  *  IER           SEIE              LL_RAMCFG_EnableIT \n
  *  IER           DEIE              LL_RAMCFG_EnableIT \n
  *  IER           ECCNMI            LL_RAMCFG_EnableIT
  * @param  p_ramcfg RAMCFG Instance.
  * @param  mask Interrupt sources to enable.
  *         This parameter can be a combination of the following values:
  *           @arg @ref LL_RAMCFG_IT_SE    : Single Error Interrupt Mask.
  *           @arg @ref LL_RAMCFG_IT_DE    : Double Error Interrupt Mask.
  *           @arg @ref LL_RAMCFG_IT_NMI   : Double Error Interrupt redirection to NMI Mask.
  *           @arg @ref LL_RAMCFG_IT_ALL   : All Interrupt Mask.
  */
__STATIC_INLINE void LL_RAMCFG_EnableIT(RAMCFG_TypeDef *p_ramcfg, uint32_t mask)
{
  STM32_SET_BIT(p_ramcfg->IER, mask);
}

/**
  * @brief  Disable the specified RAMCFG interrupts.
  * @rmtoll
  *  IER           SEIE              LL_RAMCFG_DisableIT \n
  *  IER           DEIE              LL_RAMCFG_DisableIT
  * @param  p_ramcfg RAMCFG Instance.
  * @param  mask Interrupt sources to disable.
  *         This parameter can be a combination of the following values:
  *           @arg @ref LL_RAMCFG_IT_SE : Single Error Interrupt Mask.
  *           @arg @ref LL_RAMCFG_IT_DE : Double Error Interrupt Mask.
  * @note   LL_RAMCFG_IT_NMI is cleared only by a global RAMCFG reset.
  */
__STATIC_INLINE void LL_RAMCFG_DisableIT(RAMCFG_TypeDef *p_ramcfg, uint32_t mask)
{
  STM32_CLEAR_BIT(p_ramcfg->IER, mask);
}

/**
  * @brief  Enable the ECC single error RAMCFG interrupt.
  * @rmtoll
  *  IER           SEIE              LL_RAMCFG_EnableIT_SE
  * @param  p_ramcfg RAMCFG Instance.
  */
__STATIC_INLINE void LL_RAMCFG_EnableIT_SE(RAMCFG_TypeDef *p_ramcfg)
{
  STM32_SET_BIT(p_ramcfg->IER, LL_RAMCFG_IT_SE);
}

/**
  * @brief  Disable the ECC single error RAMCFG interrupt.
  * @rmtoll
  *  IER           SEIE              LL_RAMCFG_DisableIT_SE
  * @param  p_ramcfg RAMCFG Instance.
  */
__STATIC_INLINE void LL_RAMCFG_DisableIT_SE(RAMCFG_TypeDef *p_ramcfg)
{
  STM32_CLEAR_BIT(p_ramcfg->IER, LL_RAMCFG_IT_SE);
}

/**
  * @brief  Check whether the ECC single error RAMCFG interrupt is enabled.
  * @rmtoll
  *  IER           SEIE              LL_RAMCFG_IsEnabledIT_SE
  * @param  p_ramcfg RAMCFG Instance.
  * @return State of interrupts sources (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RAMCFG_IsEnabledIT_SE(const RAMCFG_TypeDef *p_ramcfg)
{
  return ((STM32_READ_BIT(p_ramcfg->IER, LL_RAMCFG_IT_SE) == (LL_RAMCFG_IT_SE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the ECC double error RAMCFG interrupt.
  * @rmtoll
  *  IER           DEIE              LL_RAMCFG_EnableIT_DE
  * @param  p_ramcfg RAMCFG Instance.
  */
__STATIC_INLINE void LL_RAMCFG_EnableIT_DE(RAMCFG_TypeDef *p_ramcfg)
{
  STM32_SET_BIT(p_ramcfg->IER, LL_RAMCFG_IT_DE);
}

/**
  * @brief  Disable the ECC double error RAMCFG interrupt.
  * @rmtoll
  *  IER           DEIE              LL_RAMCFG_DisableIT_DE
  * @param  p_ramcfg RAMCFG Instance.
  */
__STATIC_INLINE void LL_RAMCFG_DisableIT_DE(RAMCFG_TypeDef *p_ramcfg)
{
  STM32_CLEAR_BIT(p_ramcfg->IER, LL_RAMCFG_IT_DE);
}

/**
  * @brief  Check whether the ECC double error RAMCFG interrupt is enabled.
  * @rmtoll
  *  IER           DEIE              LL_RAMCFG_IsEnabledIT_DE
  * @param  p_ramcfg RAMCFG Instance.
  * @return State of interrupts sources (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RAMCFG_IsEnabledIT_DE(const RAMCFG_TypeDef *p_ramcfg)
{
  return ((STM32_READ_BIT(p_ramcfg->IER, LL_RAMCFG_IT_DE) == (LL_RAMCFG_IT_DE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the ECC double error redirected to NMI interrupt.
  * @rmtoll
  *  IER           ECCNMI            LL_RAMCFG_EnableIT_NMI
  * @param  p_ramcfg RAMCFG Instance.
  */
__STATIC_INLINE void LL_RAMCFG_EnableIT_NMI(RAMCFG_TypeDef *p_ramcfg)
{
  STM32_SET_BIT(p_ramcfg->IER, LL_RAMCFG_IT_NMI);
}

/**
  * @brief  Check whether the ECC double error redirected to NMI interrupt is enabled.
  * @rmtoll
  *  IER           ECCNMI            LL_RAMCFG_IsEnabledIT_NMI
  * @param  p_ramcfg RAMCFG Instance.
  * @return State of interrupts sources (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RAMCFG_IsEnabledIT_NMI(const RAMCFG_TypeDef *p_ramcfg)
{
  return ((STM32_READ_BIT(p_ramcfg->IER, LL_RAMCFG_IT_NMI) == (LL_RAMCFG_IT_NMI)) ? 1UL : 0UL);
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_LL_RAMCFG_H */
